---
kind: enumMember
id: F:Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally.DoNotSaveLinks
enum: Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally
source: html/78055133-73c1-eac8-fbc2-2197ffe9d6a5.htm
---
# Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally.DoNotSaveLinks

Any modified linked files will not be saved. The links will return to their previous
 position the next time the file is loaded.